docs/main.org
#+SETUPFILE: ./Setup/setupFile.org
#+AUTHOR: Vincent Picaud
#+PROPERTY: header-args:julia :session *JuliaDoc_session* :exports code :eval no-export
#+HTML_HEAD_EXTRA: <style type="text/css"> blockquote {background:#EEEEEE; padding: 3px 13px}    </style>
#+HTML_HEAD_EXTRA: <style type="text/css"> pre {background:#EEEEEE; padding: 3px 13px}    </style>
#+TITLE: Package Documentation

#+BEGIN_EXPORT latex
\definecolor{bg}{rgb}{0.95,0.95,0.95}
\setminted[]{
  bgcolor=bg,
  breaklines=true,
  breakanywhere=true,
  mathescape,
  fontsize=\footnotesize}
#+END_EXPORT

#+BEGIN_SRC julia :results output none :eval no-export :exports none
using Revise
using J4Org
initialize_boxing_module(boxingModule="J4OrgBoxing",usedModules=["J4Org"],force=true)
cd(expanduser("~/GitHub/J4Org.jl/docs/"))
#+END_SRC

# Also use Foo as example 
#+BEGIN_SRC julia :results output none :eval no-export :exports none
push!(LOAD_PATH,pwd()*"/minimal_example/")
initialize_boxing_module(usedModules=["Foo"],force=true)
#+END_SRC

* Introduction

J4Org.jl is a Julia package that allows Julia doc generation into an
Org-Mode document. The goal is to be able to code and document Julia
packages without leaving Emacs and to reduce as much as possible the
burden of documentation. This package depends on [[https://github.com/KristofferC/Tokenize.jl/][Tokenize.jl]], to
tokenize Julia code.

** Minimal requirements 

You need [[https://orgmode.org/][Org-Mode]] plus [[https://github.com/gjkerns/ob-julia/blob/master/ob-julia-doc.org][ob-julia.el]], which has [[http://stat.ethz.ch/ESS/index.php?Section=download][ESS]] as dependence, to be
installed.

** Getting started with a minimal example

The following is a minimal example you can reproduce to have a taste
of what this package do.

*** Emacs configuration

You first need a minimal =init.el= file to configure Emacs.

#+BEGIN_SRC emacs-lisp :eval never :tangle yes :tangle minimal_example/init.el
(package-initialize)

(require 'ess-site)
;; if required
;; (setq  inferior-julia-program-name "/path/to/julia-release-basic")

(require 'org)
;; *replace me* with your own ob-julia.el file location 
(add-to-list 'load-path "~/GitLab/WorkingWithOrgMode/EmacsFiles")
;; babel configuration
(setq org-confirm-babel-evaluate nil)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((julia . t)))
#+END_SRC

#+RESULTS:

