docs/main.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-16 Mon 18:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Package Documentation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vincent Picaud" />
<link rel="stylesheet" type="text/css" href="http://orgmode.org/worg/style/worg.css"/>

</head>
<body>
<div id="content">
<h1 class="title">Package Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0d56e4c">1. Introduction</a>
<ul>
<li><a href="#org497ee04">1.1. Minimal requirements</a></li>
<li><a href="#orgf5f553a">1.2. Getting started with a minimal example</a>
<ul>
<li><a href="#orgca75a28">1.2.1. Emacs configuration</a></li>
<li><a href="#org97ef136">1.2.2. A documented Julia <code>Foo</code> module</a></li>
<li><a href="#org2d1e862">1.2.3. Minimal OrgMode document</a></li>
<li><a href="#org4c270d4">1.2.4. Generating the doc</a></li>
<li><a href="#orgbc8e7a5">1.2.5. Improving exported document style</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org60c084f">2. More examples</a>
<ul>
<li><a href="#orgf5d80aa">2.1. <code>print_org_doc</code> options</a>
<ul>
<li><a href="#org0b15fc3">2.1.1. <code>header_level</code></a></li>
<li><a href="#orged22a29">2.1.2. <code>tag</code>, <code>tag_to_ignore</code>, <code>identifier</code></a></li>
<li><a href="#orge7fd708">2.1.3. <code>complete_link</code></a></li>
<li><a href="#org6a5007c">2.1.4. <code>link_prefix</code></a></li>
<li><a href="#orgdf721a0">2.1.5. <code>case_sensitive</code></a></li>
<li><a href="#orgb8a5683">2.1.6. <code>boxingModule</code></a></li>
</ul>
</li>
<li><a href="#org2f0d971">2.2. Error reporting</a></li>
<li><a href="#org6715593">2.3. Compatibility with docstring / documenter.jl</a></li>
</ul>
</li>
<li><a href="#org8cf3a45">3. API</a></li>
<li><a href="#org9a6644d">4. Unit tests</a></li>
<li><a href="#orgf2cdc6e">5. Code/Design tips</a>
<ul>
<li><a href="#org0478ddd">5.1. PDF export &amp; phantomsection</a></li>
<li><a href="#org6eb6c91">5.2. HTML export with background</a></li>
<li><a href="#orgd7bc743">5.3. Steps to add a new item</a>
<ul>
<li><a href="#org6edb9f4">5.3.1. <code>tokenizer.jl</code> file</a></li>
<li><a href="#orgf90ab09">5.3.2. <code>extract.jl</code> file</a></li>
<li><a href="#org63620d8">5.3.3. <code>link.jl</code> file</a></li>
<li><a href="#org903f4fa">5.3.4. <code>documented_item.jl</code></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org0d56e4c" class="outline-2">
<h2 id="org0d56e4c"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
J4Org.jl is a Julia package that allows Julia doc generation into an
Org-Mode document. The goal is to be able to code and document Julia
packages without leaving Emacs and to reduce as much as possible the
burden of documentation. This package depends on <a href="https://github.com/KristofferC/Tokenize.jl/">Tokenize.jl</a>, to
tokenize Julia code.
</p>
</div>

<div id="outline-container-org497ee04" class="outline-3">
<h3 id="org497ee04"><span class="section-number-3">1.1</span> Minimal requirements</h3>
<div class="outline-text-3" id="text-1-1">
<p>
You need <a href="https://orgmode.org/">Org-Mode</a> plus <a href="https://github.com/gjkerns/ob-julia/blob/master/ob-julia-doc.org">ob-julia.el</a>, which has <a href="http://stat.ethz.ch/ESS/index.php?Section=download">ESS</a> as dependence, to be
installed.
</p>
</div>
</div>

<div id="outline-container-orgf5f553a" class="outline-3">
<h3 id="orgf5f553a"><span class="section-number-3">1.2</span> Getting started with a minimal example</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The following is a minimal example you can reproduce to have a taste
of what this package do.
</p>
</div>

<div id="outline-container-orgca75a28" class="outline-4">
<h4 id="orgca75a28"><span class="section-number-4">1.2.1</span> Emacs configuration</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
You first need a minimal <code>init.el</code> file to configure Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(package-initialize)

(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">ess-site</span>)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">if required</span>
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(setq  inferior-julia-program-name "/path/to/julia-release-basic")</span>

(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">org</span>)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">*replace me* with your own ob-julia.el file location </span>
(add-to-list 'load-path <span style="color: #8b2252;">"~/GitLab/WorkingWithOrgMode/EmacsFiles"</span>)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">babel configuration</span>
(<span style="color: #a020f0;">setq</span> org-confirm-babel-evaluate nil)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((julia . t)))
</pre>
</div>
</div>
</div>
