docs/main.org
*** A documented Julia =Foo= module
    :PROPERTIES:
    :ID:       2ae4bb8f-17f2-4cb7-9fba-eff22bea6a92
    :END:

Then you need a documented module:

#+BEGIN_SRC julia :eval never :tangle yes :tangle minimal_example/Foo.jl
module Foo

export Point, foo
    
import Base: norm

#+Point L:Point_struct
# This is my Point structure
#
# *Example:*
#
# Creates a point $p$ of coordinates $(x=1,y=2)$.
#
# #+BEGIN_SRC julia :eval never :exports code
# p=Point(1,2)
# #+END_SRC
#
# You can add any valid Org mode directive. If you want to use
# in-documentation link, use [[norm_link_example][]]
#
struct Point
    x::Float64
    y::Float64
end

#+Point
# Creates Point at origin $(0,0)$ 
Point() = Point(0,0)

#+Enum
# An enum
@enum Alpha A=1 B C # just for example

#+Point,Method L:norm_link_example
# A simple function that computes $\sqrt{x^2+y^2}$
#
# *Example:*
#!p=Point(1.0,2.0);
#!norm(p) 
#
# See: [[Point_struct][]]
#
norm(p::Point)::Float64 = sqrt(p.x*p.x+p.y*p.y)

# +Method,Internal
# An internal function
#
# For symbol that are not exported, do not forget the "Foo." prefix:
# !p=Point(1.0,2.0)
# !Foo.foo(2.0,p)
foo(r::Float64,p::Point) = Point(r*p.x,r*p.y)

end 
#+END_SRC

I wanted to reduce the documentation process as much as possible. The
template is very simple. Before each item you want to document add
these comment lines:

#+BEGIN_SRC julia :eval never :exports code 
#+Tag1,Tag2,... L:an_extra_link_if_required 
#
# Here you can put any Org mode text, for instance $sin(x)$
#
#!sin(5) # julia code to be executed
#
# [[internal_link][]]
struct A_Documented_Struct 
...
end 
#+END_SRC

- *#+Tag1,Tag2,...* is mandatory, "#+" is followed by a list of
  tags. Later when you want to extract doc you can do filtering
  according these tags.

- *L:an_extra_link_if_required* is *not* mandatory. It defines a
  reference if you want to create doc links. The previous statement
  defines a link *target* named =an_extra_link_if_required=.

- *[[internal_link][]]* creates a link to a previously defined
  *L:internal_link*.

- *!sin(5)* will execute Julia code and include the output in the
  doc. If you only want to include Julia code without executing it,
  simply use Org mode source block:
#+BEGIN_SRC julia :eval never :exports code 
# #+BEGIN_SRC julia :eval never :exports code
# sin(5)
# #+END_SRC
#+END_SRC

**** Support for "# +" and "# !" (since v0.2.0)

As you can see (foo() function comments), "# \plus", "#\plus" and "#
!", "#!" are synonyms.  The motivation is a better integration with
[[https://github.com/QBobWatson/poporg][poporg]] Emacs package.  With this Emacs package you can edit comment
under OrgMode mode without being bothered by the "#" characters.

*** Minimal OrgMode document

This is the =foo.org= file.

# I use bash instead of org, othewise PDF export is not working properly.
#+BEGIN_SRC org :eval never :tangle yes :tangle minimal_example/foo.org 
,#+PROPERTY: header-args:julia :session *my_session* :exports code :eval no-export
,#+OPTIONS: ^:{}
,#+TITLE: Getting Started with a minimal example

,#+BEGIN_SRC julia :results output none :eval no-export :exports none
push!(LOAD_PATH,pwd())
,#+END_SRC

,#+BEGIN_SRC julia :results output none :eval no-export :exports none
using J4Org 
initialize_boxing_module(usedModules=["Foo"]) 
documented_items=create_documented_item_array("Foo.jl")
,#+END_SRC

,* Example

Prints all documented items, except those tagged with "Internal" 
,#+BEGIN_SRC julia :results output drawer :eval no-export :exports results
print_org_doc(documented_items,tag_to_ignore=["Internal"],header_level=0)
,#+END_SRC
#+END_SRC

#+RESULTS:


- *push!(LOAD_PATH,pwd())* tells Julia where it can find our local =Foo=
  module. This statement is only required if the documented module is
  in an unusual place.

- *using J4Org* uses this package

- *initialize_boxing_module(usedModules=["Foo"])* defines what are
  the modules to use when executing Julia code extracted from the doc
  (the "#!" statements). Here we are documenting the =Foo= module,
  hence we must use it. Note that you can also use any number of extra
  modules for instance with =["Foo", "ExtraModule", ...]=. See
  [[API_initialize_boxing_module][initialize_boxing_module(...)]] for further details.

- *create_documented_item_array("Foo.jl")* creates the list of
  documented items from file "Foo.jl". You can use a list of files and
  a directory, see [[API_create_documented_item_array_filename][create_documented_item_array(...)]] for further details.

- *print_org_doc(documented_items,tag_to_ignore=["Internal"],header_level=0)*
  prints all documented items, except those tagged with "Internal",
  see [[API_print_org_doc_API][print_org_doc(...)]] for further details

*** Generating the doc

To check that it works you can start a fresh emacs with

#+BEGIN_SRC bash :eval never
emacs -q --load init.el foo.org &
#+END_SRC

#+RESULTS:

then type:
- =C-c C-v b= + =RET= to execute all source code blocks
- =C-c C-e h o= to html-export the file 
- =C-c C-e l o= to pdf-export the file 

You should get this [[file:minimal_example/foo.html][minimal_example/foo.html]] file.

