docs/main.html

<div id="outline-container-org97ef136" class="outline-4">
<h4 id="org97ef136"><a id="ID-2ae4bb8f-17f2-4cb7-9fba-eff22bea6a92"></a><span class="section-number-4">1.2.2</span> A documented Julia <code>Foo</code> module</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Then you need a documented module:
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">module</span> Foo

<span style="color: #a020f0;">export</span> Point, foo
    
<span style="color: #a020f0;">import</span> Base: norm

<span style="color: #b22222;">#</span><span style="color: #b22222;">+Point L:Point_struct</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">This is my Point structure</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">*Example:*</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Creates a point $p$ of coordinates $(x=1,y=2)$.</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">#+BEGIN_SRC julia :eval never :exports code</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">p=Point(1,2)</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">#+END_SRC</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">You can add any valid Org mode directive. If you want to use</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">in-documentation link, use [[norm_link_example][]]</span>
<span style="color: #b22222;">#</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Point</span>
    x::<span style="color: #228b22;">Float64</span>
    y::<span style="color: #228b22;">Float64</span>
<span style="color: #a020f0;">end</span>

<span style="color: #b22222;">#</span><span style="color: #b22222;">+Point</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Creates Point at origin $(0,0)$ </span>
<span style="color: #0000ff;">Point</span>() = Point(0,0)

<span style="color: #b22222;">#</span><span style="color: #b22222;">+Enum</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">An enum</span>
<span style="color: #483d8b;">@enum</span> Alpha A=1 B C <span style="color: #b22222;"># </span><span style="color: #b22222;">just for example</span>

<span style="color: #b22222;">#</span><span style="color: #b22222;">+Point,Method L:norm_link_example</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">A simple function that computes $\sqrt{x^2+y^2}$</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">*Example:*</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">!p=Point(1.0,2.0);</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">!norm(p) </span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">See: [[Point_struct][]]</span>
<span style="color: #b22222;">#</span>
<span style="color: #0000ff;">norm</span>(p::<span style="color: #228b22;">Point</span>)::<span style="color: #228b22;">Float64</span> = sqrt(p.x*p.x+p.y*p.y)

<span style="color: #b22222;"># </span><span style="color: #b22222;">+Method,Internal</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">An internal function</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">For symbol that are not exported, do not forget the "Foo." prefix:</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">!p=Point(1.0,2.0)</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">!Foo.foo(2.0,p)</span>
<span style="color: #0000ff;">foo</span>(r::<span style="color: #228b22;">Float64</span>,p::<span style="color: #228b22;">Point</span>) = Point(r*p.x,r*p.y)

<span style="color: #a020f0;">end</span> 
</pre>
</div>

<p>
I wanted to reduce the documentation process as much as possible. The
template is very simple. Before each item you want to document add
these comment lines:
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #b22222;">#</span><span style="color: #b22222;">+Tag1,Tag2,... L:an_extra_link_if_required </span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">Here you can put any Org mode text, for instance $sin(x)$</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">!sin(5) # julia code to be executed</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">[[internal_link][]]</span>
<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">A_Documented_Struct</span> 
...
<span style="color: #a020f0;">end</span> 
</pre>
</div>

<ul class="org-ul">
<li><b>#+Tag1,Tag2,&#x2026;</b> is mandatory, "#+" is followed by a list of
tags. Later when you want to extract doc you can do filtering
according these tags.</li>

<li><b>L:an_extra_link_if_required</b> is <b>not</b> mandatory. It defines a
reference if you want to create doc links. The previous statement
defines a link <b>target</b> named <code>an_extra_link_if_required</code>.</li>

<li><b>[[internal_link][]]</b> creates a link to a previously defined
<b>L:internal_link</b>.</li>

<li><b>!sin(5)</b> will execute Julia code and include the output in the
doc. If you only want to include Julia code without executing it,
simply use Org mode source block:</li>
</ul>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #b22222;"># </span><span style="color: #b22222;">#+BEGIN_SRC julia :eval never :exports code</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">sin(5)</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">#+END_SRC</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org9a1fee6"></a>Support for "# +" and "# !" (since v0.2.0)<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
As you can see (foo() function comments), "# +", "#+" and "#
!", "#!" are synonyms.  The motivation is a better integration with
<a href="https://github.com/QBobWatson/poporg">poporg</a> Emacs package.  With this Emacs package you can edit comment
under OrgMode mode without being bothered by the "#" characters.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org2d1e862" class="outline-4">
<h4 id="org2d1e862"><span class="section-number-4">1.2.3</span> Minimal OrgMode document</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
This is the <code>foo.org</code> file.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #b22222;">#+PROPERTY: header-args:julia :session *my_session* :exports code :eval no-export</span>
<span style="color: #b22222;">#+OPTIONS: ^:{}</span>
<span style="color: #7f7f7f;">#+TITLE:</span> <span style="color: #191970; font-weight: bold;">Getting Started with a minimal example</span>

<span style="color: #b22222;">#+BEGIN_SRC julia :results output none :eval no-export :exports none</span>
<span style="color: #7f7f7f;">push!(LOAD_PATH,pwd())</span>
<span style="color: #b22222;">#+END_SRC</span>

<span style="color: #b22222;">#+BEGIN_SRC julia :results output none :eval no-export :exports none</span>
<span style="color: #a020f0;">using</span><span style="color: #7f7f7f;"> J4Org </span>
<span style="color: #7f7f7f;">initialize_boxing_module(usedModules=[</span><span style="color: #8b2252;">"Foo"</span><span style="color: #7f7f7f;">]) </span>
<span style="color: #7f7f7f;">documented_items=create_documented_item_array(</span><span style="color: #8b2252;">"Foo.jl"</span><span style="color: #7f7f7f;">)</span>
<span style="color: #b22222;">#+END_SRC</span>

<span style="color: #0000ff;">* Example</span>

Prints all documented items, except those tagged with "Internal" 
<span style="color: #b22222;">#+BEGIN_SRC julia :results output drawer :eval no-export :exports results</span>
<span style="color: #7f7f7f;">print_org_doc(documented_items,tag_to_ignore=[</span><span style="color: #8b2252;">"Internal"</span><span style="color: #7f7f7f;">],header_level=0)</span>
<span style="color: #b22222;">#+END_SRC</span>
</pre>
</div>


<ul class="org-ul">
<li><b>push!(LOAD_PATH,pwd())</b> tells Julia where it can find our local <code>Foo</code>
module. This statement is only required if the documented module is
in an unusual place.</li>

<li><b>using J4Org</b> uses this package</li>

<li><b>initialize_boxing_module(usedModules=["Foo"])</b> defines what are
the modules to use when executing Julia code extracted from the doc
(the "#!" statements). Here we are documenting the <code>Foo</code> module,
hence we must use it. Note that you can also use any number of extra
modules for instance with <code>["Foo", "ExtraModule", ...]</code>. See
<a href="#orgb7e8da9">initialize_boxing_module(&#x2026;)</a> for further details.</li>

<li><b>create_documented_item_array("Foo.jl")</b> creates the list of
documented items from file "Foo.jl". You can use a list of files and
a directory, see <a href="#org04e479d">create_documented_item_array(&#x2026;)</a> for further details.</li>

<li><b>print_org_doc(documented_items,tag_to_ignore=["Internal"],header_level=0)</b>
prints all documented items, except those tagged with "Internal",
see <a href="#org62c826a">print_org_doc(&#x2026;)</a> for further details</li>
</ul>
</div>
</div>

<div id="outline-container-org4c270d4" class="outline-4">
<h4 id="org4c270d4"><span class="section-number-4">1.2.4</span> Generating the doc</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
To check that it works you can start a fresh emacs with
</p>

<div class="org-src-container">
<pre class="src src-bash">emacs -q --load init.el foo.org &amp;
</pre>
</div>

<p>
then type:
</p>
<ul class="org-ul">
<li><code>C-c C-v b</code> + <code>RET</code> to execute all source code blocks</li>
<li><code>C-c C-e h o</code> to html-export the file</li>
<li><code>C-c C-e l o</code> to pdf-export the file</li>
</ul>

<p>
You should get this <a href="minimal_example/foo.html">minimal_example/foo.html</a> file.
</p>
</div>
</div>
