docs/main.org
*** Improving exported document style

This was a minimal example, you can have a better look for the
exported documents by including css theme, etc. This is the approach
we used to generate *this* document (also see the [[file:main.pdf][main.pdf]] PDF file).
Another example is [[https://vincent-picaud.github.io/DirectConvolution.jl/docs.html][DirectConvolution.jl documentation]]. 

* More examples 

We still use our [[id:2ae4bb8f-17f2-4cb7-9fba-eff22bea6a92][=Foo=]] module to provide more examples. The complete [[id:c9053a86-dea5-4bc2-a883-92a1bfde20ba][API]] is detailed after.

** =print_org_doc= options

The [[API_print_org_doc_API][print_org_doc(...)]] function has several options, let's see some usage examples

*** =header_level=

This integer can have these values:
- *-1*: do not print header nor index, see [[id:bda53362-32fb-4096-9c0a-32c0afb96b5f][header_level=-1]]
- *0*: print header beginning with "-", see [[id:842e5c47-62d1-44fc-8489-e105a45f5dd4][header_level=0]].
- *l>0* create subsection of level *l*, for instance *header_level=3*
  creates subsections beginning with *3* stars. See
  [[id:0f6a49dc-ee9f-4964-8801-8badfb67f735][header_level=5]]. *Caveat:* for *l>0* AFAIK there is a bug in OrgMode,
  because a residual *:RESULT:* is printed.

**** header_level=-1
     :PROPERTIES:
     :ID:       bda53362-32fb-4096-9c0a-32c0afb96b5f
     :END:

#+BEGIN_src julia :eval never :exports code
,#+BEGIN_SRC julia :results output drawer :eval no-export :exports results 
documented_items=create_documented_item_array("minimal_example/Foo.jl");
print_org_doc(documented_items,tag="Method",header_level=-1,with_body=true)
,#+END_SRC
#+END_SRC

This will generate (here =with_body=true= this mean that we also
extract code body).

#+BEGIN_SRC julia :results output drawer :eval no-export :exports results 
documented_items=create_documented_item_array("minimal_example/Foo.jl");
print_org_doc(documented_items,tag="Method",header_level=-1,with_body=true)
#+END_SRC

#+RESULTS:
:RESULTS:

ERROR: AssertionError: Module BoxingModule does not exist, create a new one with initialize_boxing_module()
Stacktrace:
 [1] with_hash_evaluate(::String, ::String) at /home/picaud/GitHub/J4Org.jl/src/evaluate.jl:92
 [2] org_string_comment(::J4Org.Documented_Item, ::Array{J4Org.Documented_Item,1}, ::Array{J4Org.Documented_Item,1}, ::String, ::String) at /home/picaud/GitHub/J4Org.jl/src/org_string_comment.jl:34
 [3] #org_string_documented_item#32(::String, ::Bool, ::String, ::String, ::Int64, ::String, ::Bool, ::Function, ::J4Org.Documented_Item, ::Array{J4Org.Documented_Item,1}, ::Array{J4Org.Documented_Item,1}) at /home/picaud/GitHub/J4Org.jl/src/main.jl:107
 [4] #org_string_documented_item at ./none:0 [inlined]
 [5] #org_string_documented_item_array#39(::Int64, ::String, ::Bool, ::Bool, ::String, ::Bool, ::Function, ::Array{J4Org.Documented_Item,1}, ::getfield(J4Org, Symbol("#predicate#46")){String,String,String}) at /home/picaud/GitHub/J4Org.jl/src/main.jl:305
 [6] #org_string_documented_item_array at ./none:0 [inlined]
 [7] #org_string_documented_item_array#45 at /home/picaud/GitHub/J4Org.jl/src/main.jl:349 [inlined]
 [8] #org_string_documented_item_array at ./none:0 [inlined]
 [9] #print_org_doc#47 at /home/picaud/GitHub/J4Org.jl/src/main.jl:391 [inlined]
 [10] (::getfield(J4Org, Symbol("#kw##print_org_doc")))(::NamedTuple{(:tag, :header_level, :with_body),Tuple{String,Int64,Bool}}, ::typeof(print_org_doc), ::Array{J4Org.Documented_Item,1}) at ./none:0
 [11] top-level scope at none:0
:END:


**** header_level=0
     :PROPERTIES:
     :ID:       842e5c47-62d1-44fc-8489-e105a45f5dd4
     :END:

#+BEGIN_src julia :eval never :exports code
,#+BEGIN_SRC julia :results output drawer :eval no-export :exports results
documented_items=create_documented_item_array("minimal_example/Foo.jl");
print_org_doc(documented_items,tag="Method",header_level=0)
,#+END_SRC
#+END_SRC

This will generate:

#+BEGIN_SRC julia :results output drawer :eval no-export :exports results
documented_items=create_documented_item_array("minimal_example/Foo.jl");
print_org_doc(documented_items,tag="Method",header_level=0)
#+END_SRC

#+RESULTS:
:RESULTS:
2.23606797749979


<<dBCvfWoi>> *Index:* *[f]* [[5c0v1kbs][foo]] *[n]* [[WebpFDJ0][norm]] 
- @@latex:\phantomsection@@ *=foo=*  <<5c0v1kbs>>
#+BEGIN_SRC julia :eval never :exports code
foo(r::Float64,p::Point)
#+END_SRC
#+BEGIN_QUOTE
An internal function

For symbol that are not exported, do not forget the "Foo." prefix:
#+BEGIN_SRC julia
p=Point(1.0,2.0)
Foo.foo(2.0,p)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC julia
Foo.Point(1.0, 2.0)
Foo.Point(2.0, 4.0)
#+END_SRC

#+RESULTS:

#+END_QUOTE
[[file:minimal_example/Foo.jl::46][Foo.jl:46]], [[dBCvfWoi][back to index]]
- @@latex:\phantomsection@@ *=norm=*  <<WebpFDJ0>> <<UFoNykVZnorm_link_example>>
#+BEGIN_SRC julia :eval never :exports code
norm(p::Point)::Float64
#+END_SRC
#+BEGIN_QUOTE
A simple function that computes $\sqrt{x^2+y^2}$

*Example:*
#+BEGIN_SRC julia
p=Point(1.0,2.0);
norm(p) 
#+END_SRC

#+RESULTS:

#+BEGIN_SRC julia
2.23606797749979
#+END_SRC

#+RESULTS:
: 2.23606797749979

See: _struct Point_
#+END_QUOTE
[[file:minimal_example/Foo.jl::35][Foo.jl:35]], [[dBCvfWoi][back to index]]
:END:



**** header_level=5
     :PROPERTIES:
     :ID:       0f6a49dc-ee9f-4964-8801-8badfb67f735
     :END:

#+BEGIN_src julia :eval never :exports code 
,#+BEGIN_SRC julia :results output drawer :eval no-export :exports results
documented_items=create_documented_item_array("minimal_example/Foo.jl");
print_org_doc(documented_items,tag="Method",header_level=5)
,#+END_SRC
#+END_SRC

This will generate:

#+BEGIN_SRC julia :results output drawer :eval no-export :exports results
documented_items=create_documented_item_array("minimal_example/Foo.jl");
print_org_doc(documented_items,tag="Method",header_level=5)
#+END_SRC

#+RESULTS:
:RESULTS:

<<ixVQVKHc>> *Index:* *[f]* [[wGdX72MB][foo]] *[n]* [[okPNhSsO][norm]] 
***** *=foo=*  <<wGdX72MB>>
#+BEGIN_SRC julia :eval never :exports code
foo(r::Float64,p::Point)
#+END_SRC
#+BEGIN_QUOTE
An internal function

For symbol that are not exported, do not forget the "Foo." prefix:
#+BEGIN_SRC julia
p=Point(1.0,2.0)
Foo.foo(2.0,p)
#+END_SRC
#+BEGIN_SRC julia
Foo.Point(1.0, 2.0)
Foo.Point(2.0, 4.0)
#+END_SRC
#+END_QUOTE
[[file:minimal_example/Foo.jl::46][Foo.jl:46]], [[ixVQVKHc][back to index]]
***** *=norm=*  <<okPNhSsO>> <<LO8vGNMEnorm_link_example>>
#+BEGIN_SRC julia :eval never :exports code
norm(p::Point)::Float64
#+END_SRC
#+BEGIN_QUOTE
A simple function that computes $\sqrt{x^2+y^2}$

*Example:*
#+BEGIN_SRC julia
p=Point(1.0,2.0);
norm(p) 
#+END_SRC
#+BEGIN_SRC julia
2.23606797749979
#+END_SRC

See: _struct Point_
#+END_QUOTE
[[file:minimal_example/Foo.jl::35][Foo.jl:35]], [[ixVQVKHc][back to index]]
:END:

