docs/main.html

<div id="outline-container-orgbc8e7a5" class="outline-4">
<h4 id="orgbc8e7a5"><span class="section-number-4">1.2.5</span> Improving exported document style</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
This was a minimal example, you can have a better look for the
exported documents by including css theme, etc. This is the approach
we used to generate <b>this</b> document (also see the <a href="main.pdf">main.pdf</a> PDF file).
Another example is <a href="https://vincent-picaud.github.io/DirectConvolution.jl/docs.html">DirectConvolution.jl documentation</a>. 
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org60c084f" class="outline-2">
<h2 id="org60c084f"><span class="section-number-2">2</span> More examples</h2>
<div class="outline-text-2" id="text-2">
<p>
We still use our <a href="#org97ef136"><code>Foo</code></a> module to provide more examples. The complete <a href="#org8cf3a45">API</a> is detailed after.
</p>
</div>

<div id="outline-container-orgf5d80aa" class="outline-3">
<h3 id="orgf5d80aa"><span class="section-number-3">2.1</span> <code>print_org_doc</code> options</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The <a href="#org62c826a">print_org_doc(&#x2026;)</a> function has several options, let's see some usage examples
</p>
</div>

<div id="outline-container-org0b15fc3" class="outline-4">
<h4 id="org0b15fc3"><span class="section-number-4">2.1.1</span> <code>header_level</code></h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
This integer can have these values:
</p>
<ul class="org-ul">
<li><b>-1</b>: do not print header nor index, see <a href="#orgdc5ed1c">header_level=-1</a></li>
<li><b>0</b>: print header beginning with "-", see <a href="#org8b71e18">header_level=0</a>.</li>
<li><b>l&gt;0</b> create subsection of level <b>l</b>, for instance <b>header_level=3</b>
creates subsections beginning with <b>3</b> stars. See
<a href="#org7e53a11">header_level=5</a>. <b>Caveat:</b> for <b>l&gt;0</b> AFAIK there is a bug in OrgMode,
because a residual <b>:RESULT:</b> is printed.</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="orgdc5ed1c"></a><a id="ID-bda53362-32fb-4096-9c0a-32c0afb96b5f"></a>header_level=-1<br />
<div class="outline-text-5" id="text-2-1-1-1">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #b22222;">#</span><span style="color: #b22222;">+BEGIN_SRC julia :results output drawer :eval no-export :exports results </span>
documented_items=create_documented_item_array(<span style="color: #8b2252;">"minimal_example/Foo.jl"</span>);
print_org_doc(documented_items,tag=<span style="color: #8b2252;">"Method"</span>,header_level=-1,with_body=<span style="color: #008b8b;">true</span>)
<span style="color: #b22222;">#</span><span style="color: #b22222;">+END_SRC</span>
</pre>
</div>

<p>
This will generate (here <code>with_body=true</code> this mean that we also
extract code body).
</p>

<p>

</p>


<div class="org-src-container">
<pre class="src src-julia"><span style="color: #0000ff;">foo</span>(r::<span style="color: #228b22;">Float64</span>,p::<span style="color: #228b22;">Point</span>) = Point(r*p.x,r*p.y)
</pre>
</div>
<blockquote>
<p>
An internal function
</p>

<p>
For symbol that are not exported, do not forget the "Foo." prefix:
</p>
<div class="org-src-container">
<pre class="src src-julia">p=Point(1.0,2.0)
Foo.foo(2.0,p)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-julia">Foo.Point(1.0, 2.0)
Foo.Point(2.0, 4.0)
</pre>
</div>
</blockquote>
<p>
<a href="minimal_example/Foo.jl#org36ddd5d">Foo.jl:46</a>
   <a id="org2b20895"></a>
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #0000ff;">norm</span>(p::<span style="color: #228b22;">Point</span>)::<span style="color: #228b22;">Float64</span> = sqrt(p.x*p.x+p.y*p.y
</pre>
</div>
<blockquote>
<p>
A simple function that computes \(\sqrt{x^2+y^2}\)
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-julia">p=Point(1.0,2.0);
norm(p) 
</pre>
</div>
<div class="org-src-container">
<pre class="src src-julia">2.23606797749979
</pre>
</div>

<p>
See: <span class="underline">struct Point</span>
</p>
</blockquote>
<p>
<a href="minimal_example/Foo.jl#org73ccc2c">Foo.jl:35</a>
</p>
</div>
</li>



<li><a id="org8b71e18"></a><a id="ID-842e5c47-62d1-44fc-8489-e105a45f5dd4"></a>header_level=0<br />
<div class="outline-text-5" id="text-2-1-1-2">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #b22222;">#</span><span style="color: #b22222;">+BEGIN_SRC julia :results output drawer :eval no-export :exports results</span>
documented_items=create_documented_item_array(<span style="color: #8b2252;">"minimal_example/Foo.jl"</span>);
print_org_doc(documented_items,tag=<span style="color: #8b2252;">"Method"</span>,header_level=0)
<span style="color: #b22222;">#</span><span style="color: #b22222;">+END_SRC</span>
</pre>
</div>

<p>
This will generate:
</p>

<p>
2.23606797749979
</p>


<p>
<a id="orge47fc66"></a> <b>Index:</b> <b>[f]</b> <a href="#org0941979">foo</a> <b>[n]</b> <a href="#orgf8fefab">norm</a> 
</p>
<ul class="org-ul">
<li><b><code>foo</code></b>  <a id="org0941979"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">foo(r::<span style="color: #228b22;">Float64</span>,p::<span style="color: #228b22;">Point</span>)
</pre>
</div>
<blockquote>
<p>
An internal function
</p>

<p>
For symbol that are not exported, do not forget the "Foo." prefix:
</p>
<div class="org-src-container">
<pre class="src src-julia">p=Point(1.0,2.0)
Foo.foo(2.0,p)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-julia">Foo.Point(1.0, 2.0)
Foo.Point(2.0, 4.0)
</pre>
</div>
</blockquote>
<p>
<a href="minimal_example/Foo.jl#org36ddd5d">Foo.jl:46</a>, <a href="#orge47fc66">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>norm</code></b>  <a id="orgf8fefab"></a> <a id="orgbad5bce"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">norm(p::<span style="color: #228b22;">Point</span>)::<span style="color: #228b22;">Float64</span>
</pre>
</div>
<blockquote>
<p>
A simple function that computes \(\sqrt{x^2+y^2}\)
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-julia">p=Point(1.0,2.0);
norm(p) 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-julia">2.23606797749979
</pre>
</div>

<p>
See: <span class="underline">struct Point</span>
</p>
</blockquote>
<p>
<a href="minimal_example/Foo.jl#org73ccc2c">Foo.jl:35</a>, <a href="#orge47fc66">back to index</a>
</p>
</div>
</li>



<li><a id="org7e53a11"></a><a id="ID-0f6a49dc-ee9f-4964-8801-8badfb67f735"></a>header_level=5<br />
<div class="outline-text-5" id="text-2-1-1-3">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #b22222;">#</span><span style="color: #b22222;">+BEGIN_SRC julia :results output drawer :eval no-export :exports results</span>
documented_items=create_documented_item_array(<span style="color: #8b2252;">"minimal_example/Foo.jl"</span>);
print_org_doc(documented_items,tag=<span style="color: #8b2252;">"Method"</span>,header_level=5)
<span style="color: #b22222;">#</span><span style="color: #b22222;">+END_SRC</span>
</pre>
</div>

<p>
This will generate:
</p>

<p>
:RESULTS:
</p>

<p>
<a id="org5b599e9"></a> <b>Index:</b> <b>[f]</b> <a href="#org9105943">foo</a> <b>[n]</b> <a href="#org4cb15ed">norm</a> 
</p>
</div>
<ol class="org-ol">
