docs/main.org
*** =tag=, =tag_to_ignore=, =identifier=
    :PROPERTIES:
    :ID:       0e085bd4-7c99-44d6-8220-3e397fff8458
    :END:

These options allow to select items to include:

- =tag= a string or an array of strings, collects all items with at least one tag in this =tag= option.
- =tag_to_ignore= a string or an array of strings, ignore all items with at least one tag in this =tag_to_ignore= option.
- =identifier= a string that stands for the structure, abstract type or function name. Collects all items with this =identifier= name.

For instance we can print =norm= identifier, restricted to =Point= tag, as follows:

#+BEGIN_src julia :eval never :exports code
,#+BEGIN_SRC julia :results output drawer :eval no-export :exports results
documented_items=create_documented_item_array("minimal_example/Foo.jl");
print_org_doc(documented_items,identifier="norm", tag="Point",header_level=-1)
,#+END_SRC
#+END_SRC

This will generate:

#+BEGIN_SRC julia :results output drawer :eval no-export :exports results
documented_items=create_documented_item_array("minimal_example/Foo.jl");
print_org_doc(documented_items,identifier="norm", tag="Point",header_level=-1)
#+END_SRC

#+RESULTS:
:RESULTS:

 @@latex:\phantomsection@@  <<e6h2ajhanorm_link_example>>
#+BEGIN_SRC julia :eval never :exports code
norm(p::Point)::Float64
#+END_SRC
#+BEGIN_QUOTE
A simple function that computes $\sqrt{x^2+y^2}$

*Example:*
#+BEGIN_SRC julia
p=Point(1.0,2.0);
norm(p) 
#+END_SRC
#+BEGIN_SRC julia
2.23606797749979
#+END_SRC

See: _struct Point_
#+END_QUOTE
[[file:minimal_example/Foo.jl::35][Foo.jl:35]]
:END:

*** =complete_link=

If you look back at [[id:0e085bd4-7c99-44d6-8220-3e397fff8458][=tag=, =tag_to_ignore=, =identifier=]] you can see,
at the end of the =norm= function documentation, that the
_Point_struct_ link is not active. The reason is that the =Point=
structure is not present. The =complete_link= option, if set to =true=
will try to fix all dangling links by including all the required
documented items. For instance, with:

#+BEGIN_src julia :eval never :exports code
,#+BEGIN_SRC julia :results output drawer :eval no-export :exports results
documented_items=create_documented_item_array("minimal_example/Foo.jl");
print_org_doc(documented_items,identifier="norm", tag="Point",header_level=-1,
              complete_link=true)
,#+END_SRC
#+END_SRC

This will generate:

#+BEGIN_SRC julia :results output drawer :eval no-export :exports results
documented_items=create_documented_item_array("minimal_example/Foo.jl");
print_org_doc(documented_items,identifier="norm", tag="Point",header_level=-1,
              complete_link=true)
#+END_SRC

#+RESULTS:
:RESULTS:

 @@latex:\phantomsection@@  <<MVpMsBmwPoint_struct>>
#+BEGIN_SRC julia :eval never :exports code
struct Point
#+END_SRC
#+BEGIN_QUOTE
This is my Point structure

*Example:*

Creates a point $p$ of coordinates $(x=1,y=2)$.

#+BEGIN_SRC julia :eval never :exports code
p=Point(1,2)
#+END_SRC

You can add any valid Org mode directive. If you want to use
in-documentation link, use [[MVpMsBmwnorm_link_example][norm(...)]]
#+END_QUOTE
[[file:minimal_example/Foo.jl::8][Foo.jl:8]]
 @@latex:\phantomsection@@  <<MVpMsBmwnorm_link_example>>
#+BEGIN_SRC julia :eval never :exports code
norm(p::Point)::Float64
#+END_SRC
#+BEGIN_QUOTE
A simple function that computes $\sqrt{x^2+y^2}$

*Example:*
#+BEGIN_SRC julia
p=Point(1.0,2.0);
norm(p) 
#+END_SRC
#+BEGIN_SRC julia
2.23606797749979
#+END_SRC

See: [[MVpMsBmwPoint_struct][struct Point]]
#+END_QUOTE
[[file:minimal_example/Foo.jl::35][Foo.jl:35]]
:END:

you see that the =Point= structure is included to make the
_struct_Point_ link active.

*** =link_prefix=

You can create link from your OrgMode document to Julia documented
items that have defined a "L:link_target". However like these items
can be extracted at several places in your OrgMode document you need
to define a prefix to avoid multiple targets with the same name.

For instance, chose a prefix, here "my_prefix" and use:
#+BEGIN_SRC julia :results none :eval never :exports code
print_org_doc(documented_items,...,link_prefix="my_prefix_")
#+END_SRC
then you can create a regular OrgMode link to this item using
​ *[​[my_prefix_link_target][some_text]]*.


*** =case_sensitive=

When set to true, generates an index as follows:
#+BEGIN_EXAMPLE
[A] ..., [B] ...,[a] ..., [b] ...,
#+END_EXAMPLE

When set to false, do not split upper/lower cases and group all A,a;B,b together:
#+BEGIN_EXAMPLE
[A] ..., [B] ...
#+END_EXAMPLE

*** =boxingModule=

Comments starting with "#!" are executed in a boxed environment
#+BEGIN_SRC julia :eval never 
module MyBoxing
using RequiredPackage_1,RequiredPackage_2,...
end 
#+END_SRC

#+BEGIN_SRC julia :eval never 
using MyBoxing

# execute "#!" statements here
#+END_SRC

This boxing is defined by the [[API_initialize_boxing_module][initialize_boxing_module(...)]] function:

#+BEGIN_SRC julia :eval never
initialize_boxing_module(boxingModule="MyBoxing",
                         usedModules=["RequiredPackage_1","RequiredPackage_2",...])
#+END_SRC

This =boxingModule= option allows you to chose your boxing environment:
#+BEGIN_SRC julia :eval never
print_org_doc(documented_items,boxingModule="MyBoxing",...)
#+END_SRC

