docs/main.html
<li><a id="orgd1593a5"></a><b><code>foo</code></b>  <a id="org9105943"></a><br />
<div class="outline-text-6" id="text-2-1-1-3-1">
<div class="org-src-container">
<pre class="src src-julia">foo(r::<span style="color: #228b22;">Float64</span>,p::<span style="color: #228b22;">Point</span>)
</pre>
</div>
<blockquote>
<p>
An internal function
</p>

<p>
For symbol that are not exported, do not forget the "Foo." prefix:
</p>
<div class="org-src-container">
<pre class="src src-julia">p=Point(1.0,2.0)
Foo.foo(2.0,p)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-julia">Foo.Point(1.0, 2.0)
Foo.Point(2.0, 4.0)
</pre>
</div>
</blockquote>
<p>
<a href="minimal_example/Foo.jl#org36ddd5d">Foo.jl:46</a>, <a href="#org5b599e9">back to index</a>
</p>
</div>
</li>
<li><a id="org59b7a37"></a><b><code>norm</code></b>  <a id="org4cb15ed"></a> <a id="org6e087e1"></a><br />
<div class="outline-text-6" id="text-2-1-1-3-2">
<div class="org-src-container">
<pre class="src src-julia">norm(p::<span style="color: #228b22;">Point</span>)::<span style="color: #228b22;">Float64</span>
</pre>
</div>
<blockquote>
<p>
A simple function that computes \(\sqrt{x^2+y^2}\)
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-julia">p=Point(1.0,2.0);
norm(p) 
</pre>
</div>
<div class="org-src-container">
<pre class="src src-julia">2.23606797749979
</pre>
</div>

<p>
See: <span class="underline">struct Point</span>
</p>
</blockquote>
<p>
<a href="minimal_example/Foo.jl#org73ccc2c">Foo.jl:35</a>, <a href="#org5b599e9">back to index</a>
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-orged22a29" class="outline-4">
<h4 id="orged22a29"><a id="ID-0e085bd4-7c99-44d6-8220-3e397fff8458"></a><span class="section-number-4">2.1.2</span> <code>tag</code>, <code>tag_to_ignore</code>, <code>identifier</code></h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
These options allow to select items to include:
</p>

<ul class="org-ul">
<li><code>tag</code> a string or an array of strings, collects all items with at least one tag in this <code>tag</code> option.</li>
<li><code>tag_to_ignore</code> a string or an array of strings, ignore all items with at least one tag in this <code>tag_to_ignore</code> option.</li>
<li><code>identifier</code> a string that stands for the structure, abstract type or function name. Collects all items with this <code>identifier</code> name.</li>
</ul>

<p>
For instance we can print <code>norm</code> identifier, restricted to <code>Point</code> tag, as follows:
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #b22222;">#</span><span style="color: #b22222;">+BEGIN_SRC julia :results output drawer :eval no-export :exports results</span>
documented_items=create_documented_item_array(<span style="color: #8b2252;">"minimal_example/Foo.jl"</span>);
print_org_doc(documented_items,identifier=<span style="color: #8b2252;">"norm"</span>, tag=<span style="color: #8b2252;">"Point"</span>,header_level=-1)
<span style="color: #b22222;">#</span><span style="color: #b22222;">+END_SRC</span>
</pre>
</div>

<p>
This will generate:
</p>

<p>

</p>

<p>
  <a id="org361a8fd"></a>
</p>
<div class="org-src-container">
<pre class="src src-julia">norm(p::<span style="color: #228b22;">Point</span>)::<span style="color: #228b22;">Float64</span>
</pre>
</div>
<blockquote>
<p>
A simple function that computes \(\sqrt{x^2+y^2}\)
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-julia">p=Point(1.0,2.0);
norm(p) 
</pre>
</div>
<div class="org-src-container">
<pre class="src src-julia">2.23606797749979
</pre>
</div>

<p>
See: <span class="underline">struct Point</span>
</p>
</blockquote>
<p>
<a href="minimal_example/Foo.jl#org73ccc2c">Foo.jl:35</a>
</p>
</div>
</div>

<div id="outline-container-orge7fd708" class="outline-4">
<h4 id="orge7fd708"><span class="section-number-4">2.1.3</span> <code>complete_link</code></h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
If you look back at <a href="#orged22a29"><code>tag</code>, <code>tag_to_ignore</code>, <code>identifier</code></a> you can see,
at the end of the <code>norm</code> function documentation, that the
<span class="underline">Point_struct</span> link is not active. The reason is that the <code>Point</code>
structure is not present. The <code>complete_link</code> option, if set to <code>true</code>
will try to fix all dangling links by including all the required
documented items. For instance, with:
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #b22222;">#</span><span style="color: #b22222;">+BEGIN_SRC julia :results output drawer :eval no-export :exports results</span>
documented_items=create_documented_item_array(<span style="color: #8b2252;">"minimal_example/Foo.jl"</span>);
print_org_doc(documented_items,identifier=<span style="color: #8b2252;">"norm"</span>, tag=<span style="color: #8b2252;">"Point"</span>,header_level=-1,
              complete_link=<span style="color: #008b8b;">true</span>)
<span style="color: #b22222;">#</span><span style="color: #b22222;">+END_SRC</span>
</pre>
</div>

<p>
This will generate:
</p>

<p>

</p>

<p>
  <a id="org1420c88"></a>
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">Point</span>
</pre>
</div>
<blockquote>
<p>
This is my Point structure
</p>

<p>
<b>Example:</b>
</p>

<p>
Creates a point \(p\) of coordinates \((x=1,y=2)\).
</p>

<div class="org-src-container">
<pre class="src src-julia">p=Point(1,2)
</pre>
</div>

<p>
You can add any valid Org mode directive. If you want to use
in-documentation link, use <a href="#orgcfdfbe8">norm(&#x2026;)</a>
</p>
</blockquote>
<p>
<a href="minimal_example/Foo.jl#orgec0a9dd">Foo.jl:8</a>
   <a id="orgcfdfbe8"></a>
</p>
<div class="org-src-container">
<pre class="src src-julia">norm(p::<span style="color: #228b22;">Point</span>)::<span style="color: #228b22;">Float64</span>
</pre>
</div>
<blockquote>
<p>
A simple function that computes \(\sqrt{x^2+y^2}\)
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-julia">p=Point(1.0,2.0);
norm(p) 
</pre>
</div>
<div class="org-src-container">
<pre class="src src-julia">2.23606797749979
</pre>
</div>

<p>
See: <a href="#org1420c88">struct Point</a>
</p>
</blockquote>
<p>
<a href="minimal_example/Foo.jl#org73ccc2c">Foo.jl:35</a>
</p>

<p>
you see that the <code>Point</code> structure is included to make the
<span class="underline">struct_Point</span> link active.
</p>
</div>
</div>

<div id="outline-container-org6a5007c" class="outline-4">
<h4 id="org6a5007c"><span class="section-number-4">2.1.4</span> <code>link_prefix</code></h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
You can create link from your OrgMode document to Julia documented
items that have defined a "L:link_target". However like these items
can be extracted at several places in your OrgMode document you need
to define a prefix to avoid multiple targets with the same name.
</p>

<p>
For instance, chose a prefix, here "my_prefix" and use:
</p>
<div class="org-src-container">
<pre class="src src-julia">print_org_doc(documented_items,...,link_prefix=<span style="color: #8b2252;">"my_prefix_"</span>)
</pre>
</div>
<p>
then you can create a regular OrgMode link to this item using
​ <b>[​[my_prefix_link_target][some_text]]</b>.
</p>
</div>
</div>


<div id="outline-container-orgdf721a0" class="outline-4">
<h4 id="orgdf721a0"><span class="section-number-4">2.1.5</span> <code>case_sensitive</code></h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
When set to true, generates an index as follows:
</p>
<pre class="example">
[A] ..., [B] ...,[a] ..., [b] ...,
</pre>

<p>
When set to false, do not split upper/lower cases and group all A,a;B,b together:
</p>
<pre class="example">
[A] ..., [B] ...
</pre>
</div>
</div>

<div id="outline-container-orgb8a5683" class="outline-4">
<h4 id="orgb8a5683"><span class="section-number-4">2.1.6</span> <code>boxingModule</code></h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
Comments starting with "#!" are executed in a boxed environment
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">module</span> MyBoxing
<span style="color: #a020f0;">using</span> RequiredPackage_1,RequiredPackage_2,...
<span style="color: #a020f0;">end</span> 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">using</span> MyBoxing

<span style="color: #b22222;"># </span><span style="color: #b22222;">execute "#!" statements here</span>
</pre>
</div>

<p>
This boxing is defined by the <a href="#orgb7e8da9">initialize_boxing_module(&#x2026;)</a> function:
</p>

<div class="org-src-container">
<pre class="src src-julia">initialize_boxing_module(boxingModule=<span style="color: #8b2252;">"MyBoxing"</span>,
                         usedModules=[<span style="color: #8b2252;">"RequiredPackage_1"</span>,<span style="color: #8b2252;">"RequiredPackage_2"</span>,...])
</pre>
</div>

<p>
This <code>boxingModule</code> option allows you to chose your boxing environment:
</p>
<div class="org-src-container">
<pre class="src src-julia">print_org_doc(documented_items,boxingModule=<span style="color: #8b2252;">"MyBoxing"</span>,...)
</pre>
</div>
</div>
</div>
</div>
