docs/main.org
** Error reporting
Error reporting is performed as OrgMode comment. For instance if you execute:
#+BEGIN_src julia :eval never :exports code
,#+BEGIN_SRC julia :results output drawer :eval no-export :exports results 
documented_items=create_documented_item_array("minimal_example/Foo.jl");
print_org_doc(documented_items,tag="Method",header_level=-1)
,#+END_SRC
#+END_SRC


you will get:
#+BEGIN_src julia :eval never :exports code
#+RESULTS:
:RESULTS:
# =WARNING:= Link target ("Point_struct", "") not found
...
:END:
#+END_SRC 
** Compatibility with docstring / documenter.jl
You can still use something like:
#+BEGIN_SRC julia :eval never :exports code
"""
    foo()

foo function ...
"""
#+Tags...
# foo function ...
foo() = ...
#+END_SRC

