docs/main.html

<div id="outline-container-org2f0d971" class="outline-3">
<h3 id="org2f0d971"><span class="section-number-3">2.2</span> Error reporting</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Error reporting is performed as OrgMode comment. For instance if you execute:
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #b22222;">#</span><span style="color: #b22222;">+BEGIN_SRC julia :results output drawer :eval no-export :exports results </span>
documented_items=create_documented_item_array(<span style="color: #8b2252;">"minimal_example/Foo.jl"</span>);
print_org_doc(documented_items,tag=<span style="color: #8b2252;">"Method"</span>,header_level=-1)
<span style="color: #b22222;">#</span><span style="color: #b22222;">+END_SRC</span>
</pre>
</div>


<p>
you will get:
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #b22222;">#</span><span style="color: #b22222;">+RESULTS:</span>
<span style="color: #483d8b;">:RESULTS</span>:
<span style="color: #b22222;"># </span><span style="color: #b22222;">=WARNING:= Link target ("Point_struct", "") not found</span>
...
<span style="color: #483d8b;">:END</span>:
</pre>
</div>
</div>
</div>
<div id="outline-container-org6715593" class="outline-3">
<h3 id="org6715593"><span class="section-number-3">2.3</span> Compatibility with docstring / documenter.jl</h3>
<div class="outline-text-3" id="text-2-3">
<p>
You can still use something like:
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #8b2252;">"""</span>
<span style="color: #8b2252;">    foo()</span>

<span style="color: #8b2252;">foo function ...</span>
<span style="color: #8b2252;">"""</span>
<span style="color: #b22222;">#</span><span style="color: #b22222;">+Tags...</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">foo function ...</span>
<span style="color: #0000ff;">foo</span>() = ...
</pre>
</div>
</div>
</div>
</div>
