docs/main.html

<div id="outline-container-org8cf3a45" class="outline-2">
<h2 id="org8cf3a45"><a id="ID-c9053a86-dea5-4bc2-a883-92a1bfde20ba"></a><span class="section-number-2">3</span> API</h2>
<div class="outline-text-2" id="text-3">
<p>
The API is simple, with very few functions:
</p>

<p>

</p>

<p>
<a id="orgd4bc0c0"></a> <b>Index:</b> <b>[c]</b> <a href="#org45d9ddf">create_documented_item_array</a>, <a href="#orged8b40d">create_documented_item_array_dir</a> <b>[i]</b> <a href="#org280cefc">initialize_boxing_module</a> <b>[p]</b> <a href="#orgedddfa4">print_org_doc</a> 
</p>
<ul class="org-ul">
<li><b><code>create_documented_item_array</code></b>  <a id="org45d9ddf"></a> <a id="org04e479d"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">create_documented_item_array</span>(filename::<span style="color: #228b22;">String</span>)::<span style="color: #228b22;">Array</span>{Documented_Item,1}

    <span style="color: #a020f0;">if</span> VERSION &lt; v<span style="color: #8b2252;">"0.7"</span>
        code = readstring(filename)
    <span style="color: #a020f0;">else</span>
        code = read(filename,<span style="color: #228b22;">String</span>)
    <span style="color: #a020f0;">end</span>
    
    tok=tokenized(code)

    n=length(tok)
    idx=1
    toReturn=<span style="color: #228b22;">Array</span>{Documented_Item,1}(0)
    
    <span style="color: #a020f0;">while</span> idx&lt;=n
        extracted_tag = find_tag(tok,idx)

        <span style="color: #b22222;"># </span><span style="color: #b22222;">no more tag?</span>
        <span style="color: #b22222;"># </span>
        <span style="color: #a020f0;">if</span> extracted_tag==<span style="color: #008b8b;">nothing</span>
            <span style="color: #a020f0;">break</span>
        <span style="color: #a020f0;">end</span> 

        <span style="color: #a020f0;">try</span>
            di=create_documented_item(extracted_tag,filename=filename)
            push!(toReturn,di)
        <span style="color: #a020f0;">catch</span> msg
            warning_message(<span style="color: #8b2252;">"cannot interpret $(filename):$(line(extracted_tag)) $(msg)"</span>)
        <span style="color: #a020f0;">end</span>

        <span style="color: #b22222;"># </span><span style="color: #b22222;">important to rescan after tag (and not after code):</span>
        <span style="color: #b22222;"># </span><span style="color: #b22222;">tag1</span>
        <span style="color: #b22222;"># </span><span style="color: #b22222;">struct foo</span>
        <span style="color: #b22222;">#   </span><span style="color: #b22222;">tag2 &lt;- catch me!</span>
        <span style="color: #b22222;">#   </span><span style="color: #b22222;">constructor</span>
        <span style="color: #b22222;"># </span><span style="color: #b22222;">end </span>
        idx=skip(extracted_tag)
    
</pre>
</div>
<blockquote>
<p>
Reads a Julia code file and returns an array of documented items.
</p>
</blockquote>
<p>
<a href="../src/documented_item.jl#orgdad1670">documented_item.jl:97</a>, <a href="#orgd4bc0c0">back to index</a>
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">create_documented_item_array</span>(filename_list::<span style="color: #228b22;">Array</span>{<span style="color: #228b22;">String</span>,1})::<span style="color: #228b22;">Array</span>{Documented_Item,1}
    docItem_array = <span style="color: #228b22;">Array</span>{Documented_Item,1}()
    
    <span style="color: #a020f0;">for</span> file <span style="color: #a020f0;">in</span> filename_list
        docItem_array = vcat(docItem_array,create_documented_item_array(file))
    <span style="color: #a020f0;">end</span> 

    <span style="color: #a020f0;">return</span> docItem_array

</pre>
</div>
<blockquote>
<p>
Reads an array of Julia code files and returns an array of
documented items.
</p>

<p>
<b>Usage example:</b> 
</p>
<div class="org-src-container">
<pre class="src src-julia">create_documented_item_array([<span style="color: #8b2252;">"file1"</span>,<span style="color: #8b2252;">"file2"</span>,...])
</pre>
</div>

<p>
<b>Note:</b> instead of a list of files you can also specify a directory,
see <a href="#orga7773fa">create_documented_item_array_dir(&#x2026;)</a>
</p>
</blockquote>
<p>
<a href="../src/documented_item.jl#org3f25e68">documented_item.jl:142</a>, <a href="#orgd4bc0c0">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>create_documented_item_array_dir</code></b>  <a id="orged8b40d"></a> <a id="orga7773fa"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">create_documented_item_array_dir</span>(dirname::<span style="color: #228b22;">AbstractString</span>)
    <span style="color: #b22222;"># </span><span style="color: #b22222;">expanded_dirname=expanduser(dirname)</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">@assert isdir(expanded_dirname)</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;"># tips from https://stackoverflow.com/questions/20484581/search-for-files-in-a-folder</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">files=filter(x-&gt;contains(x,r".jl$"), readdir(expanded_dirname))</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">map!(x-&gt;expanded_dirname*x,files,files)</span>

    file_names=scan_directory_return_file_names(dirname)
    files=filter_julia_source_code_file_names(file_names)
    <span style="color: #a020f0;">return</span> create_documented_item_array(files)

</pre>
</div>
<blockquote>
<p>
Reads all *.jl files in a directory and returns an array of
documented items.
</p>
</blockquote>
<p>
<a href="../src/documented_item.jl#orgb325362">documented_item.jl:189</a>, <a href="#orgd4bc0c0">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>initialize_boxing_module</code></b>  <a id="org280cefc"></a> <a id="orgb7e8da9"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">initialize_boxing_module</span>(;
                                  boxingModule::<span style="color: #228b22;">String</span>=<span style="color: #8b2252;">"BoxingModule"</span>,
                                  usedModules::<span style="color: #228b22;">Vector</span>{<span style="color: #228b22;">String</span>}=<span style="color: #228b22;">String</span>[],
                                  force::<span style="color: #228b22;">Bool</span>=<span style="color: #008b8b;">false</span>)::<span style="color: #228b22;">Nothing</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">Common errors</span>
    <span style="color: #483d8b;">@assert</span> boxingModule!=<span style="color: #8b2252;">""</span>
    <span style="color: #483d8b;">@assert</span> usedModules!=<span style="color: #228b22;">String</span>[<span style="color: #8b2252;">""</span>]
    
    <span style="color: #b22222;"># </span><span style="color: #b22222;">initialize a module (for boxing)</span>
    module_exists = isdefined(J4Org,<span style="color: #228b22;">Symbol</span>(boxingModule))

    <span style="color: #a020f0;">if</span> force||(!module_exists)
        <span style="color: #a020f0;">if</span> length(usedModules)&gt;0
            usedModules_asString = <span style="color: #8b2252;">"using $(foldr((x,y)-&gt;x*"</span>, <span style="color: #8b2252;">"*y,"",usedModules)[1:end-2]) "</span>
        <span style="color: #a020f0;">else</span>
            usedModules_asString = <span style="color: #8b2252;">""</span>
        <span style="color: #a020f0;">end</span>
        <span style="color: #a020f0;">if</span> VERSION &lt; v<span style="color: #8b2252;">"0.7.0-alpha"</span>
            eval(parse(<span style="color: #8b2252;">"module $(boxingModule) $(usedModules_asString) end"</span>))
        <span style="color: #a020f0;">else</span>
            Meta.eval(parse(<span style="color: #8b2252;">"module $(boxingModule) $(usedModules_asString) end"</span>))
        <span style="color: #a020f0;">end</span>
    <span style="color: #a020f0;">else</span>
        <span style="color: #b22222;"># </span><span style="color: #b22222;">force=false &amp;&amp; module_exists = true</span>
        <span style="color: #b22222;"># </span><span style="color: #b22222;">-&gt; nothing is done... interpreted as an error if usedModules if different</span>
        <span style="color: #b22222;"># </span><span style="color: #b22222;">--&gt; however for the moment we do not know how to get module "used" module_name</span>
        <span style="color: #b22222;">#     </span><span style="color: #b22222;">thus we trigger an error if usedModules is not empty </span>
        <span style="color: #483d8b;">@assert</span> isempty(usedModules) <span style="color: #8b2252;">"Tried to define an already existing module, maybe use the force=true kwarg"</span>
    <span style="color: #a020f0;">end</span>
    <span style="color: #008b8b;">nothing</span>

</pre>
</div>
<blockquote>
<p>
Initialize a boxing module. This module is used to run Julia comment
code snippet (tagged by "#!" or by "# !")
</p>

<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-julia">initialize_boxing_module(boxingModule=<span style="color: #8b2252;">"MyBoxing"</span>,
                         usedModules=[<span style="color: #8b2252;">"RequiredPackage_1"</span>,
                                      <span style="color: #8b2252;">"RequiredPackage_2"</span>,...])
</pre>
</div>

<p>
creates
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">module</span> MyBoxing
<span style="color: #a020f0;">using</span> RequiredPackage_1,RequiredPackage_2,...
<span style="color: #a020f0;">end</span> 
</pre>
</div>

<p>
and future "# !" statements are executed after using MyBoxing:
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">using</span> MyBoxing
<span style="color: #b22222;"># </span><span style="color: #b22222;">!statements</span>
</pre>
</div>
</blockquote>
<p>
<a href="../src/evaluate.jl#org0aee0b3">evaluate.jl:18</a>, <a href="#orgd4bc0c0">back to index</a>
</p>
<ul class="org-ul">
<li><b><code>print_org_doc</code></b>  <a id="orgedddfa4"></a> <a id="org62c826a"></a></li>
</ul>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">function</span> <span style="color: #0000ff;">print_org_doc</span>(di_array::<span style="color: #228b22;">Array</span>{Documented_Item,1};
                       tag::<span style="color: #228b22;">Union</span>{<span style="color: #228b22;">String</span>,<span style="color: #228b22;">Array</span>{<span style="color: #228b22;">String</span>,1}}=<span style="color: #8b2252;">""</span>,
                       tag_to_ignore::<span style="color: #228b22;">Union</span>{<span style="color: #228b22;">String</span>,<span style="color: #228b22;">Array</span>{<span style="color: #228b22;">String</span>,1}}=<span style="color: #8b2252;">""</span>,
                       identifier::<span style="color: #228b22;">String</span>=<span style="color: #8b2252;">""</span>,
                       header_level::<span style="color: #228b22;">Int</span>=0,
                       link_prefix::<span style="color: #228b22;">String</span>=randstring(),
                       complete_link::<span style="color: #228b22;">Bool</span>=<span style="color: #008b8b;">false</span>,
                       case_sensitive::<span style="color: #228b22;">Bool</span>=<span style="color: #008b8b;">true</span>,
                       boxingModule::<span style="color: #228b22;">String</span>=<span style="color: #8b2252;">"BoxingModule"</span>,
                       with_body::<span style="color: #228b22;">Bool</span>=<span style="color: #008b8b;">false</span>)
    print(org_string_documented_item_array(di_array,
                                           tag=tag,
                                           tag_to_ignore=tag_to_ignore,
                                           identifier=identifier,
                                           header_level=header_level,
                                           link_prefix=link_prefix,
                                           complete_link=complete_link,
                                           case_sensitive=case_sensitive,
                                           boxingModule=boxingModule,
                                           with_body=with_body))

</pre>
</div>
<blockquote>
<p>
Prints generated documentation to be exported by OrgMode, this is the main function of the <code>J4Org</code> package.
</p>

<p>
<b>Org-Mode Usage example:</b>
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #b22222;">#</span><span style="color: #b22222;">+BEGIN_SRC julia :results output drawer :eval no-export :exports results</span>
documented_items = create_documented_item_array_dir(<span style="color: #8b2252;">"~/GitLab/MyPackage.jl/src/"</span>);
print_org_doc(documented_items,tag=<span style="color: #8b2252;">"API"</span>,header_level=0)
<span style="color: #b22222;">#</span><span style="color: #b22222;">+END_SRC</span>
</pre>
</div>

<p>
<b>Arguments:</b>
</p>
<ul class="org-ul">
<li><code>tag</code>: tags to collect when generating the documentation</li>
<li><code>tag_to_ignore</code>: tags to ignore when generating the documentation</li>
<li><code>identifier</code>: generates documentation for this "identifier". Can be a function name, a structure name, etc…</li>
<li><code>link_prefix</code>: allows to add a prefix to extra link (#+tag L=extra_link). this is can be useful to avoid link name conflict when performing local doc extraction.</li>
<li><code>complete_link</code>: if true, try to fix link without target by adding extra items</li>
<li><code>case_sensitive</code>: case sensitive index.</li>
<li><code>boxingModule</code>: specifies the context in which "#!" code will be executed. See <a href="#orgb7e8da9">initialize_boxing_module(&#x2026;)</a> for details.</li>
<li><code>with_body::Bool</code>: if true include code body</li>
</ul>
</blockquote>
<p>
<a href="../src/main.jl#org32618f0">main.jl:359</a>, <a href="#orgd4bc0c0">back to index</a>
</p>
</div>
</div>
