docs/main.org
* More examples and Tips                                           :noexport:

*** Org-mode block in comment

For the moment these blocks are left unchanged. For the moment only EXAMPLE blocks work. For instance:
# CAVEAT: can not use RESULT because of NESTED EXAMPLE BLOCKS (org is lost!)
#+BEGIN_EXAMPLE
# Prints doc. This is the main function of the =J4Org= package.
#
# *Org-Mode Usage example:*
# #+BEGIN_EXAMPLE
# ,#+BEGIN_SRC julia :results output drawer :eval no-export :exports results
# documented_items = create_documented_item_array_dir("~/GitLab/MyPackage.jl/src/");
# print_org_doc(tag="API",header_level=0)
# ,#+END_SRC
# #+END_EXAMPLE
function print_org_doc(di_array::Array{Documented_Item,1};
                       tag::String="",
                       identifier::String="",
                       header_level::Int=0) = ...
#+END_EXAMPLE





This will generate this doc: 
#+BEGIN_SRC julia :results output drawer :eval no-export :exports results
documented_items=create_documented_item_array_dir("../src/");
print_org_doc(documented_items,identifier="print_org_doc",header_level=-1)
#+END_SRC

#+RESULTS:
:RESULTS:

 @@latex:\phantomsection@@  <<symMTtnLprint_org_doc_API>>
#+BEGIN_SRC julia :eval never :exports code
function print_org_doc(di_array::Array{Documented_Item,1};
                       tag::Union{String,Array{String,1}}="",
                       tag_to_ignore::Union{String,Array{String,1}}="",
                       identifier::String="",
                       header_level::Int=0,
                       link_prefix::String=randstring(),
                       complete_link::Bool=false,
                       case_sensitive::Bool=true,
                       boxingModule::String="BoxingModule")
#+END_SRC
#+BEGIN_QUOTE
Prints generated documentation to be exported by OrgMode, this is the main function of the =J4Org= package.

*Org-Mode Usage example:*
#+BEGIN_SRC julia :eval never :exports code
,#+BEGIN_SRC julia :results output drawer :eval no-export :exports results
documented_items = create_documented_item_array_dir("~/GitLab/MyPackage.jl/src/");
print_org_doc(documented_items,tag="API",header_level=0)
,#+END_SRC
#+END_SRC

*Arguments:*
- =tag=: tags to collect when generating the documentation
- =tag_to_ignore=: tags to ignore when generating the documentation
- =identifier=: generates documentation for this "identifier". Can be a function name, a structure name, etc…
- =link_prefix=: allows to add a prefix to extra link (#+tag L=extra_link). this is can be useful to avoid link name conflict when performing local doc extraction.
- =complete_link=: if true, try to fix link without target by adding extra items
- =case_sensitive=: case sensitive index.
- =boxingModule=: specifies the context in which "#!" code will be executed. See _initialize_boxing_module(...)_ for details.
#+END_QUOTE
[[file:../src/main.jl::350][main.jl:350]]
:END:

*** Julia code block in comment 
    :PROPERTIES:
    :ID:       f896399f-bd8f-4d68-b4ae-f67ed6a313ef
    :END:

You can define Julia code in comment:

#+BEGIN_SRC julia
,#+foo_doc
#
# You can redefine the foo function:
#
# #+BEGIN_SRC julia
# # julia code example
# foo(x::Float64) = 1
# #+END_SRC
#
foo(x::Int) = 2*x
#+END_SRC

#+RESULTS:

The generated code is:

#+RESULTS:
:RESULTS:


#+BEGIN_SRC julia
foo(x::Int)
#+END_SRC

#+RESULTS:

#+BEGIN_QUOTE
You can redefine the foo function:

#+BEGIN_SRC julia
# julia code example
foo(x::Float64) = 1
#+END_SRC

#+RESULTS:

#+END_QUOTE
[[file:./code_examples/meaninglesscode.jl::1][meaninglesscode.jl:1]]
:END:

*Note:* maybe in the future Julia SRC blocks will be evaluated,
 however this functionality is not available for the moment.

*** Obsolete stuff

You can use 
#+BEGIN_EXAMPLE
- [ ] todo 
#+END_EXAMPLE
in a comment block 

for instance
#+BEGIN_EXAMPLE
,#+Obsolete
#
#  - [ ] remove me (to be replaced by find_tag)
#
function is_tag(tok::Tokenized,idx::Int)::Bool
#+END_EXAMPLE




* Unit tests

#+BEGIN_SRC julia :results output table :exports results
include("../test/runtests.jl")
#+END_SRC

#+RESULTS:
: Test Summary: | Pass  Total
: J4Org         |  126    126

* Code/Design tips                                                
** PDF export & phantomsection 

To be able to use links everywhere we use the
="@@latex:\\phantomsection@@"= tricks. See
[[https://tex.stackexchange.com/questions/44088/when-do-i-need-to-invoke-phantomsection][when-do-i-need-to-invoke-phantomsection]] for instance.

** HTML export with background

See https://github.com/JuliaEditorSupport/julia-emacs/issues/53

** Steps to add a new item 
We use =enum= as example
*** =tokenizer.jl= file
Add: =is_enum()= and =skip_enum_block()= functions
**** tests 
Add 
#+BEGIN_SRC julia :eval never :exports code 
import J4Org: is_enum

@testset "is_enum" begin
    t=tokenized("@enum Alpha A B")
    @test is_enum(t,1)
end;

#+END_SRC
*** =extract.jl= file
Add: =struct Extracted_Enum= and =extract_enum()= function.

Then complete =extract_code()= to take into account the extracted =Documented_Item=.
**** tests 
Create a basic file like: =test/code_example/enum.jl=
#+BEGIN_SRC 
,#+Tag L:target 
# This is an enum example [[target][]]
@enum Alpha A  B=1 C
#+END_SRC
Add 
#+BEGIN_SRC julia
import J4Org: extract_enum

@testset "enum" begin
    filename="$(dirname(@__FILE__))/code_examples/enum.jl"
    t=tokenized(readstring(filename))
    r = extract_enum(t,1)
    @test r!=nothing
    @test raw_string(r) == "@enum Alpha A  B=1 C"
    @test identifier(r) == "Alpha"
end;
#+END_SRC
*** =link.jl= file 

This is not mandatory, however if you want to magnify link to enum,
you can update the =create_link_readable_part()= function.
**** tests 
Link magnification is checked in [[id:b84e7269-ae02-4c64-b180-6b50d6f8aa89][=documented_item.jl=]]
*** =documented_item.jl=
    :PROPERTIES:
    :ID:       b84e7269-ae02-4c64-b180-6b50d6f8aa89
    :END:
Add the =is_documented_enum_type()= function.
**** tests 
Add 
#+BEGIN_SRC julia :eval never :exports code 
@testset "enum" begin
    filename="$(dirname(@__FILE__))/code_examples/enum.jl"
    t=tokenized(readstring(filename))
    r=find_tag(t,1)
    di=create_documented_item(t,tag_idx(r),filename=filename)
    @test org_string_comment(di,[di],[di],"","BoxingModule") == 
      "#+BEGIN_QUOTE\nThis is an enum example [[target][@enum Alpha]]\n#+END_QUOTE\n"
    @test org_string_code(di) == 
     "#+BEGIN_SRC julia :eval never :exports code\n@enum Alpha A  B=1 C\n#+END_SRC\n"
 end;
#+END_SRC

