docs/main.html


<div id="outline-container-org9a6644d" class="outline-2">
<h2 id="org9a6644d"><span class="section-number-2">4</span> Unit tests</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
Test Summary: | Pass  Total
J4Org         |  126    126

</pre>
</div>
</div>

<div id="outline-container-orgf2cdc6e" class="outline-2">
<h2 id="orgf2cdc6e"><span class="section-number-2">5</span> Code/Design tips</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org0478ddd" class="outline-3">
<h3 id="org0478ddd"><span class="section-number-3">5.1</span> PDF export &amp; phantomsection</h3>
<div class="outline-text-3" id="text-5-1">
<p>
To be able to use links everywhere we use the
<code>"@@latex:\\phantomsection@@"</code> tricks. See
<a href="https://tex.stackexchange.com/questions/44088/when-do-i-need-to-invoke-phantomsection">when-do-i-need-to-invoke-phantomsection</a> for instance.
</p>
</div>
</div>

<div id="outline-container-org6eb6c91" class="outline-3">
<h3 id="org6eb6c91"><span class="section-number-3">5.2</span> HTML export with background</h3>
<div class="outline-text-3" id="text-5-2">
<p>
See <a href="https://github.com/JuliaEditorSupport/julia-emacs/issues/53">https://github.com/JuliaEditorSupport/julia-emacs/issues/53</a>
</p>
</div>
</div>

<div id="outline-container-orgd7bc743" class="outline-3">
<h3 id="orgd7bc743"><span class="section-number-3">5.3</span> Steps to add a new item</h3>
<div class="outline-text-3" id="text-5-3">
<p>
We use <code>enum</code> as example
</p>
</div>
<div id="outline-container-org6edb9f4" class="outline-4">
<h4 id="org6edb9f4"><span class="section-number-4">5.3.1</span> <code>tokenizer.jl</code> file</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
Add: <code>is_enum()</code> and <code>skip_enum_block()</code> functions
</p>
</div>
<ol class="org-ol">
<li><a id="org9a81248"></a>tests<br />
<div class="outline-text-5" id="text-5-3-1-1">
<p>
Add 
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">import</span> J4Org: is_enum

<span style="color: #483d8b;">@testset</span> <span style="color: #8b2252;">"is_enum"</span> <span style="color: #a020f0;">begin</span>
    t=tokenized(<span style="color: #8b2252;">"@enum Alpha A B"</span>)
    <span style="color: #483d8b;">@test</span> is_enum(t,1)
<span style="color: #a020f0;">end</span>;

</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgf90ab09" class="outline-4">
<h4 id="orgf90ab09"><span class="section-number-4">5.3.2</span> <code>extract.jl</code> file</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
Add: <code>struct Extracted_Enum</code> and <code>extract_enum()</code> function.
</p>

<p>
Then complete <code>extract_code()</code> to take into account the extracted <code>Documented_Item</code>.
</p>
</div>
<ol class="org-ol">
<li><a id="orgc96dd75"></a>tests<br />
<div class="outline-text-5" id="text-5-3-2-1">
<p>
Create a basic file like: <code>test/code_example/enum.jl</code>
</p>
<pre class="example">
#+Tag L:target 
# This is an enum example [[target][]]
@enum Alpha A  B=1 C
</pre>
<p>
Add 
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #a020f0;">import</span> J4Org: extract_enum

<span style="color: #483d8b;">@testset</span> <span style="color: #8b2252;">"enum"</span> <span style="color: #a020f0;">begin</span>
    filename=<span style="color: #8b2252;">"$(dirname(@__FILE__))/code_examples/enum.jl"</span>
    t=tokenized(readstring(filename))
    r = extract_enum(t,1)
    <span style="color: #483d8b;">@test</span> r!=<span style="color: #008b8b;">nothing</span>
    <span style="color: #483d8b;">@test</span> raw_string(r) == <span style="color: #8b2252;">"@enum Alpha A  B=1 C"</span>
    <span style="color: #483d8b;">@test</span> identifier(r) == <span style="color: #8b2252;">"Alpha"</span>
<span style="color: #a020f0;">end</span>;
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org63620d8" class="outline-4">
<h4 id="org63620d8"><span class="section-number-4">5.3.3</span> <code>link.jl</code> file</h4>
<div class="outline-text-4" id="text-5-3-3">
<p>
This is not mandatory, however if you want to magnify link to enum,
you can update the <code>create_link_readable_part()</code> function.
</p>
</div>
<ol class="org-ol">
<li><a id="org02547a0"></a>tests<br />
<div class="outline-text-5" id="text-5-3-3-1">
<p>
Link magnification is checked in <a href="#org903f4fa"><code>documented_item.jl</code></a>
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org903f4fa" class="outline-4">
<h4 id="org903f4fa"><a id="ID-b84e7269-ae02-4c64-b180-6b50d6f8aa89"></a><span class="section-number-4">5.3.4</span> <code>documented_item.jl</code></h4>
<div class="outline-text-4" id="text-5-3-4">
<p>
Add the <code>is_documented_enum_type()</code> function.
</p>
</div>
<ol class="org-ol">
<li><a id="org436fb9f"></a>tests<br />
<div class="outline-text-5" id="text-5-3-4-1">
<p>
Add 
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #483d8b;">@testset</span> <span style="color: #8b2252;">"enum"</span> <span style="color: #a020f0;">begin</span>
    filename=<span style="color: #8b2252;">"$(dirname(@__FILE__))/code_examples/enum.jl"</span>
    t=tokenized(readstring(filename))
    r=find_tag(t,1)
    di=create_documented_item(t,tag_idx(r),filename=filename)
    <span style="color: #483d8b;">@test</span> org_string_comment(di,[di],[di],<span style="color: #8b2252;">""</span>,<span style="color: #8b2252;">"BoxingModule"</span>) == 
      <span style="color: #8b2252;">"#+BEGIN_QUOTE\nThis is an enum example [[target][@enum Alpha]]\n#+END_QUOTE\n"</span>
    <span style="color: #483d8b;">@test</span> org_string_code(di) == 
     <span style="color: #8b2252;">"#+BEGIN_SRC julia :eval never :exports code\n@enum Alpha A  B=1 C\n#+END_SRC\n"</span>
 <span style="color: #a020f0;">end</span>;
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vincent Picaud</p>
<p class="date">Created: 2018-07-16 Mon 18:43</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
